In [15]:
# Download the employees.csv file and load it in a DataFrame called csv_df using Pandas.
import pandas as pd

csv_df= pd.read_csv("employees.csv")
csv_df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

**Explanation**

Donwloaded the file, read it with Pandas and then looked at the first few rows of the data

In [8]:
# just to look into the dataframe
csv_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

**Explanation**
I used .info() just to look into the dataframe. I wanted to see all column names at once, and how many rows there are.

In [9]:
#Filter the rows that include any NaN value and put the result in a new DataFrame called noNaN_df.

noNaN_df = csv_df.dropna()
noNaN_df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal

**Explanation**
I used dropna() to drop all the rows with NaN values and saved it in a datafram called noNaN-df and showed the first few rows of it.

In [19]:
#Get all the duplicated rows (if any) and assign the result to a new DataFrame called duplicated_df. 
duplicated_df = csv_df[csv_df.duplicated()]
duplicated_df

Empty DataFrame
Columns: [First Name, Gender, Start Date, Last Login Time, Salary, Bonus %, Senior Management, Team]
Index: []

**Explanation**
I used duplicated() to find all the duplicates and the results showed that there are none

In [22]:
# Build a dummy matrix of Team values for the last 20 rows of the dataset. 
dummy_matrix = pd.get_dummies(csv_df['Team'].tail(20))
dummy_matrix

,Business Development,Client Services,Distribution,Engineering,Finance,Human Resources,Legal,Marketing,Product,Sales
980,False,False,False,True,False,False,False,False,False,False
981,False,False,False,False,False,False,True,False,False,False
982,False,False,False,False,False,True,False,False,False,False
983,False,False,False,True,False,False,False,False,False,False
984,False,False,False,True,False,False,False,False,False,False
985,False,False,False,False,False,False,True,False,False,False
986,False,False,False,False,False,False,False,True,False,False
987,False,False,False,False,True,False,False,False,False,False
988,False,False,False,False,False,True,False,False,False,False
989,False,False,False,False,False,False,True,False,False,False
990,False,True,False,False,False,False,False,False,False,False
991,False,False,False,False,False,False,False,True,False,False
992,False,False,False,False,True,False,False,False,False,False
993,False,False,False,True,False,False,False,False,False,False
994,False,False,False,False,False,False,False,True,False,False
995,False,False,True,False,False,False,False,False,False,False
996,False,False,False,False,True,False,False,False,False,False
997,False,False,False,False,False,False,False,False,True,False
998,True,False,False,False,False,False,False,False,False,False
999,False,False,False,False,False,False,False,False,False,True

**explanation**
the index shows the last 20 rows (980-999) and "True" on each row shows which team the employee belongs to.

In [28]:
# Get the unique values of the Team column
unique_values = csv_df["Team"].value_counts()
unique_values

Team
Client Services         106
Finance                 102
Business Development    101
Marketing                98
Product                  95
Sales                    94
Engineering              92
Human Resources          91
Distribution             90
Legal                    88
Name: count, dtype: int64

**explanation**

.value_counts show the unique values of each team

In [36]:
# assigning buildings for each team

mapping = {
    #building 1
    "Marketing": "Building1",
    "Client Services": "Building1",
    "Product": "Building1", 
    "Sales": "Building1",

    # building 2
    "Finance": "Building2", 
    "Legal": "Building2" , 
    "Human Resources": "Building2", 

    #building3
    "Engineering": "Building3", 
    "Business Development": "Building3",

    #building4
    "Distribution": "Building4"
}

**explanation**
I assigned building numbers to each team based on the instruction

In [37]:
# create a new column in csv_df called location and fill its values according to the value of Team column
csv_df["Location"] = csv_df["Team"].map(mapping).fillna("Administration")
csv_df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,Location
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing,Building1
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN,Administration
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance,Building2
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance,Building2
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services,Building1

**explanation**

i used map to apply the building numbers to each team, and fill na with "Administration". at llast I assigned the building numbers to a new column name location. As the results shown, the last column is a new column I added with the building number corresponding to the teams

In [41]:
#Divide the salaries into 4 bins (consider the minimum and maximum)
#then show how many people are in each salary category.

print (csv_df["Salary"].max())
print (csv_df["Salary"].min())

149908
35013

**explanation**
i printed the minimum and maximum salary just to check

In [43]:
csv_df["Salary Category"] = pd.cut(
    csv_df['Salary'],
    bins = 4
)
csv_df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,Location,Salary Category
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing,Building1,"(92460.5, 121184.25]"
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN,Administration,"(34898.105, 63736.75]"
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance,Building2,"(121184.25, 149908.0]"
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance,Building2,"(121184.25, 149908.0]"
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services,Building1,"(92460.5, 121184.25]"

**explanation**
when I set bins=4, python automatically splits the salary into 4 categories from minimum to maximum. and then I added it to a new category name "Salary Category". I thought about adding labels after the bins to label each range of salary, but did not since the assignment didn't say to name them

In [47]:
# to look at the range of each bin
csv_df["Salary Category"].cat.categories

IntervalIndex([(34898.105, 63736.75],   (63736.75, 92460.5],
                (92460.5, 121184.25], (121184.25, 149908.0]],
              dtype='interval[float64, right]')

**explanation**

I wanted to show the range of each bin so I printed them separately. As shown, it's been split into 4

In [50]:
# Assuming that bonuses higher than 9.3% are outliers, find and show all of the rows that are outliers.
outliers = csv_df[csv_df['Bonus %'] > 9.3]
outliers

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,Location,Salary Category
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance,Building2,"(121184.25, 149908.0]"
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance,Building2,"(121184.25, 149908.0]"
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal,Building2,"(92460.5, 121184.25]"
6,Ruby,Female,8/17/1987,4:20 PM,65476,10.012,True,Product,Building1,"(63736.75, 92460.5]"
7,NaN,Female,7/20/2015,10:43 AM,45906,11.598,NaN,Finance,Building2,"(34898.105, 63736.75]"
...,...,...,...,...,...,...,...,...,...,...
993,Tina,Female,5/15/1997,3:53 PM,56450,19.040,True,Engineering,Building3,"(34898.105, 63736.75]"
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution,Building4,"(121184.25, 149908.0]"
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance,Building2,"(34898.105, 63736.75]"
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development,Building3,"(34898.105, 63736.75]"
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales,Building1,"(121184.25, 149908.0]"

**explanation**
the results only showed rows with bonus over 9.3%

In [56]:
# Get all the rows whose first name starts with the letter "S".
csv_df[csv_df['First Name'].str.startswith("S", na=False)]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,Location,Salary Category
17,Shawn,Male,12/7/1986,7:45 PM,111737,6.414,False,Product,Building1,"(92460.5, 121184.25]"
27,Scott,NaN,7/11/1991,6:58 PM,122367,5.218,False,Legal,Building2,"(121184.25, 149908.0]"
38,Stephanie,Female,9/13/1986,1:52 AM,36844,5.574,True,Business Development,Building3,"(34898.105, 63736.75]"
54,Sara,Female,8/15/2007,9:23 AM,83677,8.999,False,Engineering,Building3,"(63736.75, 92460.5]"
65,Steve,Male,11/11/2009,11:44 PM,61310,12.428,True,Distribution,Building4,"(34898.105, 63736.75]"
...,...,...,...,...,...,...,...,...,...,...
960,Stephen,Male,10/29/1989,11:34 PM,93997,18.093,True,Business Development,Building3,"(92460.5, 121184.25]"
975,Susan,Female,4/7/1995,10:05 PM,92436,12.467,False,Sales,Building1,"(63736.75, 92460.5]"
977,Sarah,Female,12/4/1995,9:16 AM,124566,5.949,False,Product,Building1,"(121184.25, 149908.0]"
978,Sean,Male,1/17/1983,2:23 PM,66146,11.178,False,Human Resources,Building2,"(63736.75, 92460.5]"
985,Stephen,NaN,7/10/1983,8:10 PM,85668,1.909,False,Legal,Building2,"(63736.75, 92460.5]"

**explanation**

the result only showed rows with first names starting with "S". I used .str.startswith to search each first name.

In [58]:
# Retrieve the first 3 columns of 10 rows and create a hierarchically indexed Series based on that
retrieved = csv_df.iloc[:10, :3]
retrieved

  First Name  Gender  Start Date
0    Douglas    Male    8/6/1993
1     Thomas    Male   3/31/1996
2      Maria  Female   4/23/1993
3      Jerry    Male    3/4/2005
4      Larry    Male   1/24/1998
5     Dennis    Male   4/18/1987
6       Ruby  Female   8/17/1987
7        NaN  Female   7/20/2015
8     Angela  Female  11/22/2005
9    Frances  Female    8/8/2002

**explanation**
the result showed the first 10 rows and first 3 columns only from csv_df, and I saved it in "retrieved"

In [61]:
# hierarchically indexed series
hierarchically_series = retrieved.set_index(["First Name", "Gender"])["Start Date"]
hierarchically_series

First Name  Gender
Douglas     Male        8/6/1993
Thomas      Male       3/31/1996
Maria       Female     4/23/1993
Jerry       Male        3/4/2005
Larry       Male       1/24/1998
Dennis      Male       4/18/1987
Ruby        Female     8/17/1987
NaN         Female     7/20/2015
Angela      Female    11/22/2005
Frances     Female      8/8/2002
Name: Start Date, dtype: object

**explanation**
The hierarchically series basically gave each value 2 labels. I gave the start date 2 labels which are first name and gender.

In [64]:
# Calculate the average of salary and bonus based on the Team

average_salary= csv_df.groupby('Team')[['Salary','Bonus %']].mean()
average_salary

                            Salary    Bonus %
Team
Business Development  91866.316832  10.572376
Client Services       88224.424528  10.495104
Distribution          88500.466667   9.615644
Engineering           94269.195652  10.462989
Finance               92219.480392  10.186873
Human Resources       90944.527473   9.993879
Legal                 89303.613636  10.322830
Marketing             90435.591837  10.353449
Product               88665.505263   9.791484
Sales                 92173.436170  10.116915

**explanation**
using groupby, I grouped csv_df by "Teams" and then only looked at the "Salary" and "Bonus" columns and calculated the mean. The result showed the average salaries for each team

In [79]:
# Create a function called top() that takes a DataFrame as an input and returns the 5 highest paid entries in the DataFrame
def top (dataframe):
    return dataframe.sort_values('Salary', ascending = False).head(5)

# Then use the top() function to get the 5 highest paid people of each Gender. 
Highest_paid = (
    csv_df
    .groupby("Gender")
    .apply(top)
)

Highest_paid

/var/folders/bk/m53r57sn6ds5pz41ww5w686m0000gn/T/ipykernel_81482/2177466885.py:7: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  csv_df

           First Name  Gender Start Date Last Login Time  Salary  Bonus %  \
Gender
Female 644  Katherine  Female  8/13/1996        12:21 AM  149908   18.912
       429       Rose  Female  5/28/2015         8:40 AM  149903    5.630
       828    Cynthia  Female  7/12/2006         8:55 AM  149684    7.864
       186        NaN  Female  2/23/2005         9:50 PM  149654    1.825
       160      Kathy  Female  3/18/2000         7:26 PM  149563   16.991
Male   981      James    Male  1/15/1993         5:19 PM  148985   19.280
       800   Clarence    Male   8/5/1989         6:11 PM  148941   11.517
       850    Charles    Male   9/3/1997        10:04 AM  148291    6.002
       318        Roy    Male   8/6/2006         7:52 AM  148225    1.841
       83       Shawn    Male  9/23/2005         2:55 AM  148115    6.539

           Senior Management             Team        Location  \
Gender
Female 644             False          Finance       Building2
       429             False  Human Resources       Building2
       828             False          Product       Building1
       186               NaN            Sales       Building1
       160              True          Finance       Building2
Male   981             False            Legal       Building2
       800             False          Product       Building1
       850             False              NaN  Administration
       318             False          Finance       Building2
       83               True          Finance       Building2

                  Salary Category
Gender
Female 644  (121184.25, 149908.0]
       429  (121184.25, 149908.0]
       828  (121184.25, 149908.0]
       186  (121184.25, 149908.0]
       160  (121184.25, 149908.0]
Male   981  (121184.25, 149908.0]
       800  (121184.25, 149908.0]
       850  (121184.25, 149908.0]
       318  (121184.25, 149908.0]
       83   (121184.25, 149908.0]

**explanation**
created a funciton name top first that returns top 5 paid employees using sort values then getting the first 5 rows.
then I groupedby gender and applied the top function. The result showed highest paid top 5 employees in each gender group.